# Assignment 1 : Python Data Analysis using salaries dataset
# Data Exploration:  This should include summary statistics, means, medians, quartiles, or any other relevant information about the data set.

In [1]:
import pandas as pd 
import numpy as np
import matplotlib.pyplot as plt
%matplotlib inline
df = pd.read_csv('https://raw.githubusercontent.com/CunyLaguardiaDataAnalytics/datasets/master/Salaries.csv')
type(df)

pandas.core.frame.DataFrame

In [2]:
# 397 rows = 397 employees
df.shape

(397, 7)

In [3]:
df.head()

   Unnamed: 0      rank discipline  yrs.since.phd  yrs.service   sex  salary
0           1      Prof          B             19           18  Male  139750
1           2      Prof          B             20           16  Male  173200
2           3  AsstProf          B              4            3  Male   79750
3           4      Prof          B             45           39  Male  115000
4           5      Prof          B             40           41  Male  141500

In [4]:
df.tail()

     Unnamed: 0      rank discipline  yrs.since.phd  yrs.service   sex  salary
392         393      Prof          A             33           30  Male  103106
393         394      Prof          A             31           19  Male  150564
394         395      Prof          A             42           25  Male  101738
395         396      Prof          A             25           15  Male   95329
396         397  AsstProf          A              8            4  Male   81035

In [5]:
df.describe()

       Unnamed: 0  yrs.since.phd  yrs.service         salary
count  397.000000     397.000000   397.000000     397.000000
mean   199.000000      22.314861    17.614610  113706.458438
std    114.748275      12.887003    13.006024   30289.038695
min      1.000000       1.000000     0.000000   57800.000000
25%    100.000000      12.000000     7.000000   91000.000000
50%    199.000000      21.000000    16.000000  107300.000000
75%    298.000000      32.000000    27.000000  134185.000000
max    397.000000      56.000000    60.000000  231545.000000

In [6]:
# Mean of all salaries
df.mean()

Unnamed: 0          199.000000
yrs.since.phd        22.314861
yrs.service          17.614610
salary           113706.458438
dtype: float64

In [7]:
# Median of all salaries
df.median()

Unnamed: 0          199.0
yrs.since.phd        21.0
yrs.service          16.0
salary           107300.0
dtype: float64

# Median salary between gender and/or rank(title) Etc...
Making a new Data Frame that only has the columns 'sex' and 'salary'

In [8]:
new_df = pd.read_csv('https://raw.githubusercontent.com/CunyLaguardiaDataAnalytics/datasets/master/Salaries.csv')
new_df = df[['sex','salary']]
print(new_df)

      sex  salary
0    Male  139750
1    Male  173200
2    Male   79750
3    Male  115000
4    Male  141500
..    ...     ...
392  Male  103106
393  Male  150564
394  Male  101738
395  Male   95329
396  Male   81035

[397 rows x 2 columns]

Finding the Median salary for all males

In [9]:
male_sal=new_df[new_df['sex']=='male']
male_sal.median()

sex      NaN
salary   NaN
dtype: float64

Finding the Median salary for all females

In [12]:
female_sal=new_df[new_df['sex']=='female']
female_sal.median()

sex      NaN
salary   NaN
dtype: float64

Comparing the Mean salary of Males and Females

In [ ]:
male_sel.mean()

In [ ]:
female_sel.mean()

In [ ]:
comp = male_sel.mean()-female_sel.mean()
print(comp)

# Data Wrangling â€“ perform some basic transformations on the data
People who have 20 years of experience (Total: 157), (Mean Salary:

In [ ]:
experience = df[['service','salary']]
print(experience)

In [ ]:
total_exp = experience[experience['service']>=20]
print(total_exp.count())

In [ ]:
print(total_exp.mean())

Comparing the salaries of people who have 20+ years of experience vs less than 20 years of experience

In [ ]:
less_20 = experience[experience['service']<20]
print((less_20).mean())

In [ ]:
comp = total_exp.mean()[['salary']]-less_20.mean()[['salary']]
print(comp)

People who have salary of greater than or equal to 200,000

In [ ]:
greater = experience[experience['salary']>=200,000]
print(greater)